jorgelurodi/Trabajo_dsPIC/Trabajo_dsPIC.X/mcc_generated_files/pin_manager.h
    // Read RE9
    postValue = DUTY_GetValue();
    </code>

*/
#define DUTY_GetValue()         _RE9
/**
  @Summary
    Configures the GPIO pin, RE9, as an input.

  @Description
    Configures the GPIO pin, RE9, as an input.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Sets the RE9 as an input
    DUTY_SetDigitalInput();
    </code>

*/
#define DUTY_SetDigitalInput()  (_TRISE9 = 1)
/**
  @Summary
    Configures the GPIO pin, RE9, as an output.

  @Description
    Configures the GPIO pin, RE9, as an output.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Sets the RE9 as an output
    DUTY_SetDigitalOutput();
    </code>

*/
#define DUTY_SetDigitalOutput() (_TRISE9 = 0)

/**
    Section: Function Prototypes
*/
/**
  @Summary
    Configures the pin settings of the dsPIC33CH512MP508
    The peripheral pin select, PPS, configuration is also handled by this manager.

  @Description
    This is the generated manager file for the PIC24 / dsPIC33 / PIC32MM MCUs device.  This manager
    configures the pins direction, initial state, analog setting.
    The peripheral pin select, PPS, configuration is also handled by this manager.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    void SYSTEM_Initialize(void)
    {
        // Other initializers are called from this function
        PIN_MANAGER_Initialize();
    }
    </code>

*/
void PIN_MANAGER_Initialize (void);

/**
  @Summary
    Callback for TRIANGULAR Pin.

  @Description
    This routine is callback for TRIANGULAR Pin

  @Param
    None.

  @Returns
    None
 
 
  @Example 
    <code>
        TRIANGULAR_SetInterruptHandler(&TRIANGULAR_CallBack);
    </code>
*/
void TRIANGULAR_CallBack(void);

/**
  @Summary
    Callback for DUTY Pin.

  @Description
    This routine is callback for DUTY Pin

  @Param
    None.

  @Returns
    None
 
 
  @Example 
    <code>
        DUTY_SetInterruptHandler(&DUTY_CallBack);
    </code>
*/
void DUTY_CallBack(void);

/**
  @Summary
    Callback for SENOIDAL Pin.

  @Description
    This routine is callback for SENOIDAL Pin

  @Param
    None.

  @Returns
    None
 
 
  @Example 
    <code>
        SENOIDAL_SetInterruptHandler(&SENOIDAL_CallBack);
    </code>
*/
void SENOIDAL_CallBack(void);


/**
  @Summary
    Assigns a function pointer with a callback address.

  @Description
    This routine assigns a function pointer with a callback address.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        TRIANGULAR_SetInterruptHandler(&TRIANGULAR_CallBack);
    </code>
*/
void TRIANGULAR_SetInterruptHandler(void (* InterruptHandler)(void));

/**
  @Summary
    Assigns a function pointer with a callback address.

  @Description
    This routine assigns a function pointer with a callback address.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        TRIANGULAR_SetIOCInterruptHandler(&TRIANGULAR_CallBack);
    </code>
*/
void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse TRIANGULAR_SetInterruptHandler instead."))) TRIANGULAR_SetIOCInterruptHandler(void *handler);

/**
  @Summary
    Assigns a function pointer with a callback address.

  @Description
    This routine assigns a function pointer with a callback address.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        DUTY_SetInterruptHandler(&DUTY_CallBack);
    </code>
*/
void DUTY_SetInterruptHandler(void (* InterruptHandler)(void));

/**
  @Summary
    Assigns a function pointer with a callback address.

  @Description
    This routine assigns a function pointer with a callback address.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        DUTY_SetIOCInterruptHandler(&DUTY_CallBack);
    </code>
*/
void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse DUTY_SetInterruptHandler instead."))) DUTY_SetIOCInterruptHandler(void *handler);

/**
  @Summary
    Assigns a function pointer with a callback address.

  @Description
    This routine assigns a function pointer with a callback address.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        SENOIDAL_SetInterruptHandler(&SENOIDAL_CallBack);
    </code>
*/
void SENOIDAL_SetInterruptHandler(void (* InterruptHandler)(void));

/**
  @Summary
    Assigns a function pointer with a callback address.

  @Description
    This routine assigns a function pointer with a callback address.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        SENOIDAL_SetIOCInterruptHandler(&SENOIDAL_CallBack);
    </code>
*/
void __attribute__((deprecated("\nThis will be removed in future MCC releases. \nUse SENOIDAL_SetInterruptHandler instead."))) SENOIDAL_SetIOCInterruptHandler(void *handler);


#endif
